{
  "languages": "Languages",
  "title": "2StackStudio",
  "about": "About",
  "studio": "The Studio",
  "zhenghao": "Zhenghao Li",
  "jiusi": "Jiusi Li",
  "contact": "Contact",
  "tech-stack": "The tech stack",
  "art-stack": "The art stack",
  "project": "Project",
  "tom": "Throne of Mortals",
  "project-tower": "Project Tower",
  "learn-more": "Learn More",
  "index-page": {
    "studio": {
      "caption": "Our Studio",
      "body": {
        "l1": "Meet the two stacks behind 2StackStudio.",
        "l2": "Find out why we’re here and what we’re doing."
      }
    },
    "project": {
      "caption": "Our Project",
      "body": {
        "l1": "Watch as we develop Throne of Mortals.",
        "l2": "Check out the project and our current progress."
      }
    }
  },
  "about-page": {
    "studio": {
      "caption": "Studio",
      "body": {
        "l1": "2StackStudio is a hobbyist independent game development studio, run by a couple of UCLA grads from Beijing based in the bay area. It currently consists of a full stack artist, a full stack developer, a dog, and two computers. We are game lovers trying to leave a footprint in the indie game community.",
        "l2": "2StackStudio is focused on creating story rich, narrative driven RPGs with innovative gameplay and meaningful progression."
      }
    },
    "us": {
      "caption": "Us",
      "zhenghao": "Zhenghao is a junior full stack software engineer at AcuityMD.",
      "jiusi": "Jiusi is a current MFA student at Academy of Art University, majoring in Animation and Visual Effects."
    },
    "zhenghao": {
      "left": {
        "caption": "Personalities",
        "body": {
          "l1": "Zhenghao is a full stack software engineer at AcuityMD.",
          "l2": "Zhenghao is passionate about game development, focusing on incorporating traditional Chinese mythologies and culture into modern video games to create an authentic and unique Chinese fantasy world."
        }
      },
      "mid": {
        "caption": "Responsibilities",
        "body": {
          "l0": "Zhenghao is the software engineer of the team, transforming the studio's ideas into implementations.",
          "l1": "Unreal Engine C++/BP development",
          "l2": "Unity C# development",
          "l3": "Gameplay and level design",
          "l4": "Material and shader development",
          "l5": "Spine 2D animation creation"
        }
      },
      "right": {
        "caption": "Experiences",
        "body": {
          "l1": "Besides developing games as a hobby, Zhenghao is also experienced in web development with React, Node, and TypeScript."
        }
      }
    }
  },
  "project-page": {
    "project-tower": {
      "banner": {
        "l1": "Project Tower",
        "l2": "A playable prototype of our first attempt at Throne of Mortals"
      },
      "download": {
        "caption": "Give it a try",
        "body": {
          "l1": "Download PC version for best experience.",
          "l2": "Web build is also available for convenience with limited graphics."
        },
        "button": "Launch Web Build in Browser"
      },
      "card": {
        "caption": "Card-based Combat",
        "body": {
          "l1": "Immerse in real-time strategic combat while simultaneously controlling up to three heroes.",
          "l2": "Master a variety of heroes, each with their unique mechanics under the flow of RPG style dual resource management."
        }
      },
      "minion": {
        "caption": "Summon Minions",
        "body": {
          "l1": "Summon a variety of powerful minions from artificial constructs to mythical creatures.",
          "l2": "Taunt, charge, guard, ambush. Every minion has their unique role and behavior to aid you in your battles."
        }
      },
      "spell": {
        "caption": "Cast Spells",
        "body": {
          "l1": "Cast an arsenal of arcane and creative spells to gain direct control over the battlefield.",
          "l2": "From damage over time to crowd control, discover every hero’s specialties and their unique ways to impress the enemy."
        }
      },
      "boss": {
        "caption": "Powerful Foes",
        "body": {
          "l1": "Fight against a wide range of enemies from powerful mythical monsters to vicious cult leaders, each with different movements and attacks.",
          "l2": "Immerse in intense boss fights and defend yourself through multiple phases, learn their weaknesses and mechanics to turn the tide."
        }
      }
    }
  },
  "contact-page": {
    "caption": "Contact us",
    "body": {
      "l1": "twostackstudio@outlook.com",
      "l2": "(206) 369-7158",
      "l3": "333 El Camino Real",
      "l4": "San Carlos, CA 94070"
    },
    "form": {
      "required": "Required",
      "email-invalid": "Email is invalid",
      "submit": "Send",
      "submitted": "Success",
      "error": "Error",
      "name": "Name",
      "name-placeholder": "Your Name",
      "email": "Email",
      "email-placeholder": "Your Email",
      "message": "Message",
      "message-placeholder": "Your message"
    }
  }
}